# bgf_yolov10n.yaml  – YOLOv10-n + P2 head  (BGF style)
# -----------------------------------------------------
nc: 1          # set to 1 because you merged head/face ▸ class 0
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]              # ↓  indices shift by +3 after we insert P2
  - [-1, 1, Conv,   [64, 3, 2]]          # 0  P1/2
  - [-1, 1, Conv,   [128, 3, 2]]         # 1  P2/4  ← feature we’ll tap for P2 head
  - [-1, 3, C2f,    [128, True]]         # 2
  # ---------- ①  add a tiny refine block for P2 ----------
  - [-1, 1, Conv,   [64, 3, 1]]          # 3  P2_r
  # --------------------------------------------------------
  - [-2, 1, Conv,   [256, 3, 2]]         # 4  P3/8
  - [-1, 6, C2f,    [256, True]]         # 5
  - [-1, 1, SCDown, [512, 3, 2]]         # 6  P4/16
  - [-1, 6, C2f,    [512, True]]         # 7
  - [-1, 1, SCDown, [1024, 3, 2]]        # 8  P5/32
  - [-1, 3, C2f,    [1024, True]]        # 9
  - [-1, 1, SPPF,   [1024, 5]]           # 10
  - [-1, 1, PSA,    [1024]]              # 11

head:
  # --- upsamples stay unchanged for P3–P5 path ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                  # 14 (P4)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]                  # 17 (P3)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                  # 20 (P4/16-med)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, C2fCIB, [1024, True, True]]  # 23 (P5/32-large)

  # ---------- ②  NEW P2 head directly from backbone index 3 ----------
  - [3,  3, C2f, [128]]                  # 24 (P2/4-tiny)
  # --------------------------------------------------------

  # ---------- ③  Detect on four levels ----------
  # order: P2  P3   P4   P5
  - [[24, 17, 20, 23], 1, v10Detect, [nc]]
  # --------------------------------------------------------

anchors:
  # ⚠️  replace with anchors from `yolo detect cluster`
  # format: [[w,h], ...]  three per level  (P2,P3,P4,P5)
  # tiny  small  medium   large
  - [4,5,  8,9,  12,12,
     17,17, 24,24, 32,32,
     45,45, 64,64, 80,80,
     110,110, 160,160, 210,210]
